-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: entrant
-- ------------------------------------------------------
-- Server version	8.0.11

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `entrant`
--

DROP TABLE IF EXISTS `entrant`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `entrant` (
  `entrant_id` int(6) unsigned zerofill NOT NULL AUTO_INCREMENT,
  `user_type` int(10) unsigned NOT NULL,
  `surname` varchar(35) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `name` varchar(35) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `last_name` varchar(35) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `birthday` date NOT NULL,
  `phone_number` varchar(17) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `email` varchar(35) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `passport` varchar(11) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `document_number` varchar(14) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `date_of_issue` date NOT NULL,
  `code_1` varchar(8) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `code_2` varchar(8) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `code_3` varchar(8) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `oper_id` int(3) unsigned zerofill DEFAULT NULL,
  `filing_date` date NOT NULL,
  PRIMARY KEY (`entrant_id`,`document_number`),
  UNIQUE KEY `document_number_UNIQUE` (`document_number`),
  UNIQUE KEY `passport_UNIQUE` (`passport`),
  KEY `user_type_idx` (`user_type`),
  KEY `code_1_idx` (`code_1`),
  KEY `code_2_idx` (`code_2`),
  KEY `code_3_idx` (`code_3`),
  KEY `oper_id_idx` (`oper_id`),
  CONSTRAINT `code_1` FOREIGN KEY (`code_1`) REFERENCES `speciality` (`speciality_code`) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT `code_2` FOREIGN KEY (`code_2`) REFERENCES `speciality` (`speciality_code`) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT `code_3` FOREIGN KEY (`code_3`) REFERENCES `speciality` (`speciality_code`) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT `oper_id` FOREIGN KEY (`oper_id`) REFERENCES `worker` (`worker_id`) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT `users_type_entr` FOREIGN KEY (`user_type`) REFERENCES `users_type` (`type_id`) ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `entrant`
--

LOCK TABLES `entrant` WRITE;
/*!40000 ALTER TABLE `entrant` DISABLE KEYS */;
INSERT INTO `entrant` VALUES (000001,3,'Александров','Виктор','Петрович','2003-10-14','+7 (956) 565-6567','aleksandrov@ma.il','4578 454654','04545000045454','2021-06-25','01.03.02','03.03.01','05.03.03',006,'2020-07-03'),(000002,3,'Никонорова','Виктория','Сергеевна','2003-03-21','+7 (987) 845-6454','nikonorova@ma.il','4786 535132','01557000056465','2021-06-25','05.03.04','18.03.01','—',021,'2020-07-03'),(000003,3,'Скрынников','Михаил','Петрович','2003-02-01','+7 (956) 564-6565','skrynnikov@ma.il','4785 154055','04587000012570','2021-06-25','37.03.01','38.03.01','18.03.01',015,'2020-07-03'),(000004,3,'Алексеев','Василий','Викторович','2003-11-22','+7 (965) 664-6865','alekseev@ma.il','4784 564654','04545000054588','2021-06-25','08.03.01','09.03.03','09.03.01',013,'2020-07-03'),(000005,3,'Исаева','Алёна','','2003-02-04','+7 (945) 465-4657','isaeva@ma.il','4546 684654','04587000021589','2021-06-26','01.03.02','01.03.04','05.03.03',020,'2020-07-04'),(000006,3,'Савин','Максим','Валерьевич','2003-06-30','+7 (905) 030-5534','savin@ma.il','4548 908500','04587000012597','2021-06-25','41.03.04','—','40.03.01',008,'2020-07-04'),(000007,3,'Сталин','Иван','Александрович','2003-10-18','+7 (956) 715-6456','stalin@ma.il','4174 734441','01574000015471','2021-06-26','08.03.01','09.03.03','01.03.04',027,'2020-07-04'),(000008,3,'Сыров','Вячеслав','Юрьевич','2003-08-15','+7 (954) 545-0014','syrov@ma.il','4150 805404','01578000047851','2021-06-25','37.03.01','—','—',006,'2020-07-04'),(000009,3,'Остапов','Григорий','Иванович','2003-01-15','+7 (940) 646-8754','ostapov@ma.il','4874 656868','04578000012059','2021-06-25','40.03.01','38.03.01','46.03.01',020,'2020-07-05'),(000010,3,'Иванников','Аристарх','Николаевич','2003-02-24','+7 (954) 058-0044','ivannikov@ma.il','4874 565465','04578000041577','2021-06-25','03.03.01','04.03.02','18.03.01',027,'2020-07-05'),(000011,3,'Семёнов','Михаил','Васильевич','2003-05-01','+7 (941) 205-4101','semyonov@ma.il','4850 220378','01457000054878','2021-06-26','09.03.01','09.03.03','01.03.02',013,'2020-07-06'),(000012,3,'Терёхина','Милена','Вениаминовна','2003-01-01','+7 (954) 156-4045','teryohina@ma.il','4845 568401','01457000041506','2021-06-25','37.03.01','38.03.01','08.03.01',026,'2020-07-06'),(000013,3,'Мищенко','Ангелина','Львовна','2003-05-23','+7 (956) 506-0565','mischenko@ma.il','4050 560650','01545000054485','2021-06-26','09.03.01','09.03.03','01.03.04',019,'2020-07-07'),(000014,3,'Тимошенко','Иван','Анатольевич','2003-09-06','+7 (965) 606-5656','timoshenko@ma.il','4405 055500','04578000010578','2021-06-25','08.03.01','05.03.04','18.03.01',026,'2020-07-07'),(000015,3,'Козликов','Афанасий','Ефимович','2003-01-11','+7 (950) 450-8074','kozlikov@ma.il','4544 440400','01547000015457','2021-06-25','—','41.03.04','38.03.01',009,'2020-07-07'),(000016,3,'Карпов','Валерий','Николаевич','2003-04-17','+7 (950) 545-6405','karpov@ma.il','4848 804188','04578000012057','2021-06-25','05.03.03','05.03.04','37.03.01',007,'2020-07-07'),(000017,3,'Карпова','Анастасия','Николаевна','2003-04-17','+7 (950) 545-6406','karpova@ma.il','4848 804189','04578000012058','2021-06-25','37.03.01','38.03.01','—',019,'2020-07-07'),(000018,3,'Ставропольцев','Владислав','Петрович','2003-10-17','+7 (926) 506-0650','stavropoltsev@ma.il','4878 004074','04152000014785','2021-06-25','09.03.01','18.03.01','46.03.01',028,'2020-07-08'),(000019,3,'Петрова','Юлия','Владимировна','2003-02-27','+7 (954) 564-5451','petrova@ma.il','4508 540808','04157000025894','2021-06-25','04.03.02','08.03.01','01.03.04',012,'2020-07-08'),(000020,3,'Лялина','Елена','Петровна','2003-11-01','+7 (950) 550-4545','lyalina@ma.il','4504 055504','01257000012059','2021-06-26','09.03.01','09.03.03','04.03.02',009,'2020-07-08'),(000021,3,'Никифорова','Анастасия','Сергеевна','2003-08-15','+7 (987) 654-3357','nikiforova@ma.il','4472 976342','04637000084765','2021-06-26','37.03.01','38.03.01','—',007,'2020-07-09'),(000022,3,'Кузьмина','Ксения','Николаевна','2003-08-24','+7 (945) 562-5684','kuzmima@ma.il','4234 326754','04657000098743','2021-06-25','37.03.01','38.03.01','—',015,'2020-07-09'),(000023,3,'Зимин','Виктор','Степанович','2003-01-07','+7 (986) 736-4838','zimin@ma.il','4367 580234','03451000034567','2021-06-25','37.03.01','38.03.01','—',024,'2020-07-09'),(000024,3,'Птицын','Алексей','Петрович','2003-09-03','+7 (987) 756-4535','ptitsyn@ma.il','4534 464363','04567000034513','2021-06-25','37.03.01','38.03.01','—',012,'2020-07-10'),(000025,3,'Абрикосова','Анна','Эдуардовна','2003-08-04','+7 (976) 960-7505','abrikosova@ma.il','4546 377574','05748000043892','2021-06-25','37.03.01','—','—',015,'2020-07-10'),(000026,3,'Арбузова','Анна','Петровна','2003-07-17','+7 (973) 875-0750','arbuzova@ma.il','4884 375030','04854000098754','2021-06-26','37.03.01','38.03.01','—',008,'2020-07-10'),(000027,3,'Косыгин','Никита','','2003-06-03','+7 (973) 496-5939','kosygin@ma.il','4435 830475','08745000098324','2021-06-26','37.03.01','—','—',024,'2020-07-11'),(000028,3,'Степанова','Катерина','Александровна','2003-03-01','+7 (934) 900-9304','stepanova@ma.il','0010 119012','09834000034312','2021-07-01','37.03.01','38.03.01','—',028,'2020-07-11'),(000029,3,'Меньшиков','Алексей','','2003-04-17','+7 (998) 996-6543','menshikov@ma.il','4435 435435','03453000019854','2021-06-25','38.03.01','—','—',017,'2020-07-11'),(000030,3,'Циркач','Виктор','Артемьевич','2003-04-01','+7 (930) 490-3999','tsirkach@ma.il','4543 859939','09485000098543','2021-06-25','37.03.01','38.03.01','—',010,'2020-07-12'),(000031,3,'Окунев','Степан','Михайлович','2003-05-14','+7 (983) 884-3993','okunev@ma.il','4437 959439','09543000094432','2021-06-25','37.03.01','38.03.01','—',008,'2020-07-12'),(000032,3,'Черкасова','Наталья','Алексеевна','2003-09-27','+7 (986) 504-5067','tcherkasova@ma.il','4580 438003','09546000095876','2021-06-25','37.03.01','38.03.01','—',023,'2020-07-12'),(000033,3,'Никитина','Маргарита','Степановна','2003-01-18','+7 (934) 985-0345','nikitina@ma.il','4873 485703','05456000098437','2021-06-25','04.03.02','18.03.01','—',014,'2020-07-12'),(000034,3,'Остапов','Михаил','','2003-08-03','+7 (932) 958-9923','ostapov@ma.il','5435 222432','04554000098712','2021-06-25','04.03.02','18.03.01','—',021,'2020-07-12'),(000035,3,'Агафонова','Катерина','Игоревна','2003-08-13','+7 (990) 093-4050','agafonova@ma.il','5453 534534','03109000093493','2021-06-26','04.03.02','—','—',018,'2020-07-12'),(000036,3,'Дятлова','Наталья','Игоревна','2003-07-17','+7 (947) 684-6874','dyatlova@ma.il','4380 508403','01298000034190','2021-06-27','18.03.01','04.03.02','—',023,'2020-07-13'),(000037,3,'Митин','Андрей','Федотович','2003-02-05','+7 (932) 423-5326','mitin@ma.il','4430 859853','01345000091357','2021-06-25','18.03.01','—','—',018,'2020-07-13'),(000038,3,'Виталюк','Инна','','2003-06-14','+7 (912) 940-9010','vitalyuk@ma.il','3445 345436','01123000098438','2021-06-25','04.03.02','18.03.01','—',011,'2020-07-14'),(000039,3,'Карасёва','Евгения','Витальевна','2003-03-12','+7 (932) 421-2332','karasyova@ma.il','4398 475893','01128000098239','2021-06-25','04.03.02','—','18.03.01',016,'2020-07-14'),(000040,3,'Цымбалюк','Аркадий','Павлович','2003-09-10','+7 (930) 972-6502','tsymbalyuk@ma.il','4205 703200','01239000094354','2021-06-25','04.03.02','—','—',029,'2020-07-15'),(000041,3,'Славянский','Эдуард','Алексеевич','2003-11-07','+7 (903) 285-0320','slavyanskiy@ma.il','5438 327503','03239000039294','2021-06-26','04.03.02','18.03.01','—',010,'2020-07-15'),(000042,3,'Кривлянский','Аполлон','Григорьевич','2003-10-18','+7 (984) 037-5032','krivlyanskiy@ma.il','4934 750325','03453000038971','2021-06-26','04.03.02','—','—',022,'2020-07-15'),(000043,3,'Ерёмин','Илья','Иванович','2003-11-25','+7 (939) 248-0328','eryomin@ma.il','4251 513532','04354000034543','2021-06-25','04.03.02','18.03.01','—',030,'2020-07-16'),(000044,3,'Котов','Михаил','Евгеньевич','2003-01-27','+7 (904) 305-9032','kotov@ma.il','4436 543532','04353000034353','2021-06-25','01.03.02','09.03.01','09.03.03',024,'2020-07-17'),(000045,3,'Псов','Артемий','Витальевич','2003-07-14','+7 (943) 543-5234','psov@ma.il','4454 353242','03244000023432','2021-06-25','01.03.02','09.03.01','09.03.03',011,'2020-07-17'),(000046,3,'Михайлова','Ирина','Евгеньевна','2003-04-25','+7 (902) 939-3204','mihaylova@ma.il','4354 305940','02134000023522','2021-06-25','09.03.01','01.03.04','01.03.02',022,'2020-07-17'),(000047,3,'Карась','Иван','Антонович','2003-01-12','+7 (904) 302-0490','karas@ma.il','4439 543050','01245000034124','2021-06-25','01.03.04','01.03.02','09.03.03',029,'2020-07-17'),(000048,3,'Агибалова','Валентина','Андреевна','2003-11-07','+7 (909) 909-0432','agibalova@ma.il','4493 012341','03462000063461','2021-06-25','09.03.01','09.03.03','01.03.02',011,'2020-07-18'),(000049,3,'Мирошниченко','Семён','Олегович','2003-01-01','+7 (954) 656-4234','miroshnichenko@ma.il','4324 352321','04325000032532','2021-06-25','01.03.02','01.03.04','05.03.03',016,'2020-07-18'),(000050,3,'Потапова','Елена','Владимировна','2003-05-01','+7 (900) 245-6742','potapova@ma.il','4741 425162','08588000084367','2021-06-25','05.03.03','09.03.01','09.03.03',017,'2020-07-18'),(000051,3,'Мосин','Никита','','2003-09-26','+7 (973) 298-4021','mosin@ma.il','4623 223535','04832000095321','2021-06-26','09.03.01','01.03.04','09.03.03',030,'2020-07-19'),(000052,3,'Солнцев','Денис','Анатольевич','2003-10-14','+7 (965) 899-7054','solntsev@ma.il','4826 325035','07329000094239','2021-06-25','09.03.01','05.03.03','01.03.02',027,'2020-07-19');
/*!40000 ALTER TABLE `entrant` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-11-22 16:46:07
