-- MySQL dump 10.13  Distrib 8.0.19, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: entrant
-- ------------------------------------------------------
-- Server version	8.0.11

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `exams`
--

DROP TABLE IF EXISTS `exams`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `exams` (
  `document_number` varchar(14) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `russian_language` int(10) unsigned NOT NULL,
  `maths` int(10) unsigned DEFAULT NULL,
  `information_technologies` int(10) unsigned DEFAULT NULL,
  `physics` int(10) unsigned DEFAULT NULL,
  `chemistry` int(10) unsigned DEFAULT NULL,
  `biology` int(10) unsigned DEFAULT NULL,
  `social_science` int(10) unsigned DEFAULT NULL,
  `history` int(10) unsigned DEFAULT NULL,
  `foreign_language` int(10) unsigned DEFAULT NULL,
  `literature` int(10) unsigned DEFAULT NULL,
  `geography` int(10) unsigned DEFAULT NULL,
  `personal_achievements` int(10) unsigned DEFAULT NULL,
  `comments` longtext CHARACTER SET utf8 COLLATE utf8_general_ci,
  PRIMARY KEY (`document_number`),
  UNIQUE KEY `document_number_UNIQUE` (`document_number`),
  CONSTRAINT `document_number` FOREIGN KEY (`document_number`) REFERENCES `entrant` (`document_number`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `exams`
--

LOCK TABLES `exams` WRITE;
/*!40000 ALTER TABLE `exams` DISABLE KEYS */;
INSERT INTO `exams` VALUES ('01123000098438',98,79,0,78,82,0,0,0,0,0,0,10,'Аттестат с отличием'),('01128000098239',90,85,0,80,71,0,0,0,0,0,0,10,'Аттестат с отличием'),('01239000094354',80,0,0,78,79,0,0,0,0,0,0,1,'Выпускник курсов довузовской подготовки'),('01245000034124',72,70,60,0,0,0,0,0,0,0,0,5,'Золотой знак ГТО'),('01257000012059',100,80,78,100,90,0,0,0,0,0,0,10,'Аттестат с отличием'),('01298000034190',89,80,0,78,75,0,0,0,0,0,0,10,'Аттестат с отличием'),('01345000091357',78,70,0,0,74,0,0,0,0,0,0,6,'Серебряный знак ГТО; Призёр вузовской олимпиады по математике'),('01457000041506',100,80,0,70,0,75,80,0,0,0,0,10,'Аттестат с отличием'),('01457000054878',70,70,72,0,0,0,0,0,0,0,0,0,''),('01545000054485',90,80,82,0,0,0,0,0,0,0,0,5,'Золотой знак ГТО'),('01547000015457',70,63,0,0,0,0,60,68,63,70,0,5,'Золотой знак ГТО'),('01557000056465',79,70,0,0,74,68,0,0,0,0,65,5,'Золотой знак ГТО'),('01574000015471',92,80,68,71,0,0,0,0,0,0,0,5,'Золотой знак ГТО'),('01578000047851',80,68,0,0,0,80,78,0,75,70,0,5,'Золотой знак ГТО'),('02134000023522',80,78,70,0,0,0,0,0,0,0,0,10,'Аттестат с отличием'),('03109000093493',84,0,0,78,80,0,0,0,0,0,0,0,''),('03239000039294',100,78,0,67,79,0,0,0,0,0,0,5,'Золотой знак ГТО'),('03244000023432',88,65,70,0,0,0,0,0,0,0,0,1,'Выпускник курсов довузовской подготовки'),('03451000034567',100,98,0,0,0,90,85,0,0,0,0,10,'Аттестат с отличием'),('03453000019854',69,70,0,0,0,0,80,0,0,0,0,4,'Серебряный знак ГТО; выпускник курсов довузовской подготовки'),('03453000038971',89,0,0,90,80,0,0,0,0,0,0,9,'Золотой знак ГТО; призёр вузовской олимпиады по химии; выпускник курсов довузовской подготовки'),('03462000063461',90,81,75,0,0,0,0,0,0,0,0,6,'Золотой знак ГТО; Выпускница курсов довузовской подготовки'),('04152000014785',78,78,70,0,60,0,65,60,0,0,0,5,'Золотой знак ГТО'),('04157000025894',88,80,60,68,78,0,0,0,0,0,0,10,'Аттестат с отличием'),('04325000032532',90,75,76,0,0,0,0,0,0,0,70,0,''),('04353000034353',98,90,86,0,0,0,0,0,0,0,0,5,'Золотой знак ГТО'),('04354000034543',87,85,0,78,70,0,0,0,0,0,0,10,'Аттестат с отличием'),('04545000045454',85,80,78,69,0,0,0,0,0,0,70,5,'Победитель вузовской олимпиады по математике'),('04545000054588',92,80,84,78,0,0,0,0,0,0,0,0,''),('04554000098712',75,70,0,70,65,0,0,0,0,0,0,8,'Серебряный знак ГТО; Победитель вузовской олимпиады по математике'),('04567000034513',92,88,0,0,0,58,60,0,0,0,0,5,'Золотой знак ГТО'),('04578000010578',90,75,0,72,70,78,0,0,0,0,75,1,'Выпускник курсов довузовской подготовки'),('04578000012057',75,70,70,0,0,84,71,0,0,0,76,1,'Выпускник курсов довузовской подготовки'),('04578000012058',100,92,0,0,0,80,75,0,70,68,0,10,'Аттестат с отличием'),('04578000012059',94,90,0,0,0,0,90,78,0,0,0,10,'Аттестат с отличием'),('04578000041577',70,65,0,55,70,0,0,0,0,0,0,0,''),('04587000012570',75,78,0,0,80,78,75,0,0,0,0,10,'Аттестат с отличием'),('04587000012597',80,0,0,0,0,0,72,65,70,70,0,0,''),('04587000021589',84,84,78,0,0,0,0,0,0,0,70,10,'Аттестат с отличием'),('04637000084765',90,78,0,0,0,58,61,0,0,0,0,0,''),('04657000098743',70,50,0,0,0,51,54,0,0,0,0,0,''),('04832000095321',95,44,80,0,0,0,0,0,0,0,0,10,'Золотой знак ГТО; Призёр вузовской олимпиады по информатике; Волонтёрская деятельность; Выпускник курсов довузовской подготовки'),('04854000098754',95,75,0,70,68,66,72,0,0,0,0,10,'Аттестат с отличием'),('05456000098437',90,78,0,64,70,0,0,0,0,0,0,5,'Победитель вузовской олимпиады по математике'),('05748000043892',100,76,0,0,77,68,70,0,0,0,0,10,'Победитель вузовской олимпиады по биологии; Золотой знак ГТО'),('07329000094239',78,80,68,0,0,0,0,0,0,0,70,5,'Золотой знак ГТО'),('08588000084367',82,68,76,0,0,0,0,0,0,0,70,3,'Серебряный знак ГТО'),('08745000098324',78,78,0,0,0,79,80,0,0,0,0,1,'Выпускник курсов довузовской подготовки'),('09485000098543',75,70,0,0,0,60,65,0,0,0,0,3,'Серебряный знак ГТО'),('09543000094432',90,80,0,0,0,74,70,0,0,0,0,10,'Победитель вузовской олимпиады по математке; Золотой знак ГТО'),('09546000095876',98,90,0,0,0,76,76,0,0,0,0,10,'Аттестат с отличием'),('09834000034312',72,80,0,0,0,80,78,0,0,0,0,3,'Золотой знак ГТО');
/*!40000 ALTER TABLE `exams` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-11-22 16:46:07
